
const catalog = [
    {
        item: 10001,
        title: "Sportif's Original Short",
        price: 40,
        imgSrc: "1.png",
        size: [32, 34, 36, 38],
        color: ['beige', 'black', 'red'],
        details: "With its classic design, practical features and unequaled comfort - it's no wonder Sportif 'Original' stretch cargo shorts are practically the uniform on yachts worldwide! A customer favorite for over 50 years, they're called the world's best boating shorts. Featuring a 4 inch inseam for sizes 30-40 and 5.5 inch inseam for sizes 42-46. "
    },
    {
        item: 10002,
        title: "Sportif's Hatteras Short",
        price: 49,
        imgSrc: '2.png',
        size: [32, 34, 36, 38, 40, 46],
        color: ['gray', 'brown', 'red'],
        details: "Зручні шорти Sportif's Hatteras Short від Carhartt. Вони виготовлені з еластичного та стійкого до пошкоджень матеріалу. Вони ідеально підходять для повсякденного використання, кемпінгу, туристичних походів або роботи на свіжому повітрі в теплі дні."
    },
    {
        item: 10003,
        title: "Sportif's Tidewater Short",
        price: 54,
        imgSrc: '3.png',
        size: [32, 34, 38, 40, 42, 46],
        color: ['beige', 'black', 'red'],
        details: ". Матеріал: 59% бавовна, 39% поліестер, 2% спандекс. Виробник: Carhartt, США Виробник: Carhartt, США."

    },
    {
        item: 10004,
        title: "Sportif's Lauderdale Short",
        price: 67,
        imgSrc: '4.png',
        size: [38, 40, 42, 46],
        color: ['beige', 'black', 'red'],
        details: ". Матеріал: 59% бавовна, 39% поліестер, 2% спандекс. Виробник: Carhartt, США Виробник: Carhartt, США."
    },
    {
        item: 10005,
        title: "Captains Short",
        price: 54,
        imgSrc: '5.png',
        size: [32, 34, 38, 40, 42, 44, 46],
        color: ['beige', 'black', 'red'],
        details: "Відмінний вибір як для повсякденного носіння, так і для походів/виїздів на природу. Тканина даного варіанту -  100% бавовна ріпстоп. Міцні, легкі, дихаючі та приємні на дотик."
    },
    {
        item: 10006,
        title: "Galapagos Plain Short",
        price: 34,
        imgSrc: '6.png',
        size: [30, 32, 34, 36, 38, 40, 42, 44, 46],
        color: ['beige', 'black', 'red'],
        details: "Відмінний вибір як для повсякденного носіння, так і для походів/виїздів на природу. Тканина даного варіанту -  100% бавовна ріпстоп. Міцні, легкі, дихаючі та приємні на дотик."
    },
    {
        item: 10007,
        title: "Galapagos Pleated Short",
        price: 41,
        imgSrc: '7.png',
        size:  [40, 42, 44, 46],
        color: ['beige', 'black', 'red'],
        details: "Відмінний вибір як для повсякденного носіння, так і для походів/виїздів на природу. Тканина даного варіанту -  100% бавовна ріпстоп. Міцні, легкі, дихаючі та приємні на дотик."
    },
    {
        item: 10008,
        title: "Tidewater Denim Short",
        price: 69,
        imgSrc: '8.png',
        size:  [44, 46],
        color: ['beige', 'black', 'red'],
        details: "Відмінний вибір як для повсякденного носіння, так і для походів/виїздів на природу. Тканина даного варіанту -  100% бавовна ріпстоп. Міцні, легкі, дихаючі та приємні на дотик."
    },
    {
        item: 10009,
        title: "Hatteras Short",
        price: 40,
        imgSrc: '9.png',
        size:  [30, 32, 34],
        color: ['beige', 'black', 'red'],
        details: "Відмінний вибір як для повсякденного носіння, так і для походів/виїздів на природу. Тканина даного варіанту -  100% бавовна ріпстоп. Міцні, легкі, дихаючі та приємні на дотик."
    },
    {
        item: 10010,
        title: "Echots Short",
        price: 41,
        imgSrc: '10.png',
        size:  [30, 32, 34, 36, 38, 40, 42, 44, 46],
        color: ['beige', 'black', 'red'],
        details: "Відмінний вибір як для повсякденного носіння, так і для походів/виїздів на природу. Тканина даного варіанту -  100% бавовна ріпстоп. Міцні, легкі, дихаючі та приємні на дотик."
    },
    {
        item: 10011,
        title: "Ecolts Cannon Short",
        price: 42,
        imgSrc: '11.png',
        size:  [30, 32, 34, 38, 40, 46],
        color: ['beige', 'black', 'red', 'gray'],
        details: "Відмінний вибір як для повсякденного носіння, так і для походів/виїздів на природу. Тканина даного варіанту -  100% бавовна ріпстоп. Міцні, легкі, дихаючі та приємні на дотик."
    },
    {
        item: 10012,
        title: "Ecolts Short",
        price: 42,
        imgSrc: '12-1.jpg',
        size:  [30, 32, 34, 40, 42,],
        color: ['beige', 'brown', 'red', 'gray'],
        details: "Відмінний вибір як для повсякденного носіння, так і для походів/виїздів на природу. Тканина даного варіанту -  100% бавовна ріпстоп. Міцні, легкі, дихаючі та приємні на дотик."
    },
    {
        item: 10013,
        title: "Flex RipStop Шорти",
        price: 39,
        imgSrc: '13.jpg',
        size:  [30, 32, 34, 40, 42,],
        color: ['black', 'beige', 'brown', 'red', 'gray', 'yellow','green'],
        details: "Зручні шорти Cargo Work від Carhartt. Вони виготовлені з еластичного та стійкого до пошкоджень матеріалу. Вони ідеально підходять для повсякденного використання, кемпінгу, туристичних походів або роботи на свіжому повітрі в теплі дні."
    },
    {
        item: 10014,
        title: "Шорти Carhartt Cargo",
        price: 50,
        imgSrc: '14.jpg',
        size:  [30, 32, 34, 40, 42,],
        color: ['black', 'gray', 'yellow','green'],
        details: "Зручні шорти зроблені з бавовни. Підкладка поясу та кишень виконана з суміші поліестеру та бавовни. Відмінний вибір не тільки для любителів мілітарі та експедицій на виживання, а й для всіх, хто полюбляє активний спосіб життя."
    },
    {
        item: 10015,
        title: "Шорти Cargo",
        price: 70,
        imgSrc: '15.jpg',
        size:  [30, 32, 34, 40, 42, 46],
        color: ['red', 'black', 'gray', 'yellow','green'],
        details: "Досконалий компроміс між військовим і цивільним одягом - стриманий крій, функціональність бойових шорт."
    },
    {
        item: 10016,
        title: "Чоловічі шорти Military",
        price: 105,
        imgSrc: '16.jpg',
        size:  [ 34, 38, 40, 42, 46],
        color: ['beige', 'black', 'gray'],
        details: "Шорти оснащені 6 кишенями: дві класичні кишені, дві бічні карго-кишені на ґудзиках та дві плоскі кишені на сідницях. Отвір закривається на кнопку."
    },
    {
        item: 10017,
        title: "Tренувальні шорти",
        price: 50,
        imgSrc: '17.png',
        size:  [ 30, 32, 34, 38, 40],
        color: ['beige', 'black', 'gray'],
        details: "Шорти мають стриманий військовий напис на штанині та жакардову нашивку на задній кишені."
    },
    {
        item: 10018,
        title: "Rip-Stop Shorts Khaki",
        price: 85,
        imgSrc: '18.jpg',
        size:  [ 30, 32, 34, 36, 38],
        color: ['red','beige','yellow', 'gray'],
        details: "Зручні шорти, натхненні кроєм класичних американських військових штанів. Виготовлена повністю з міцної, високоякісної бавовни. Стійке до розривів і розривів плетіння RipStop ідеально підходить для будь-якої активності, як в польових умовах, так і в місті.Планка застібається на ґудзики. Шнурки на талії дають можливість регулювати обхват без необхідності носити брючний ремінь."
    },
    {
        item: 10019,
        title: "Ranger шорти",
        price: 36,
        imgSrc: '19.png',
        size:  [ 30, 32, 34, 36, 38, 40, 42],
        color: ['green', 'gray' ],
        details: "Зручні шорти, які є укороченим варіантом крою американських рейнджерів. Відмінний вибір не тільки для любителів військових і експедицій на виживання, але і для всіх, хто любить активний спосіб життя. Вони виготовлені з суміші поліестеру та бавовни. Крім того, вони дуже функціональні - мають шість кишень та зручний бортик."
    },
    {
        item: 10020,
        title: "Шорти M-Tac Aggressor",
        price: 100.00,
        imgSrc: '20.jpg',
        size:  [34, 36, 38, 40, 46],
        color: ['beige','yellow', 'gray', 'green'],
        details: "Шорти Агресор поєднують в собі стриманий зовнішній вигляд з функціональністю бойових.  Завдяки великій кількості кишень та їх раціональному розташуванню дана модель відмінно підійде для міських умов, але також не підведе і під час кемпінгових походів або експедицій на природу."
    },
    {
        item: 10021,
        title: "Бавовняні шорти M-Tac",
        price: 36,
        imgSrc: '21.jpg',
        size:  [ 36, 38, 40, 42, 44, 46],
        color: ['green', 'gray', 'black'],
        details: "Шорти оснащені двома поздовжніми, відкритими бічними кишенями що забезпечують швидкий доступ до найнеобхідніших речей. На лівій кишені розміщений логотип виробника."
    },
    {
        item: 10022,
        title: "Шорти Alpinus Hekla",
        price: 45,
        imgSrc: '22.jpg',
        size:  [ 40, 42, 44, 46],
        color: ['green', 'gray', 'black','beige'],
        details: "Легкі та зручні чоловічі шорти польської фірми Alpinus, виготовлені зі 100% бавовни. Простий крій забезпечує комфорт та свободу рухів у будь-яких умовах. Чудово підійде для повсякденного носіння, кемпінгу чи походу"
    },
    {
        item: 10023,
        title: "Бавовняні шорти M-Tac",
        price: 100,
        imgSrc: '23.jpg',
        size:  [ 32, 34, 36, 40],
        color: ['green', 'gray', 'black','beige'],
        details: "Легкі та комфортні чоловічі шорти від польської компанії Alpinus виготовлені з бавовни з додаванням поліестеру. Прямий крій забезпечує комфорт та свободу рухів. Ідеально підійде для повсякденного носіння, кемпінгу чи туристичних походів.Талія на шнурках дозволяє краще прилягати до тіла власника. Дві класичні кишені та дві бічні кишені вантажного типу дозволяють переносити та зберігати необхідні аксесуари. "
    },
    {
        item: 10024,
        title: "Colin’s Шорти джинсові",
        price: 99,
        imgSrc: '24.jpg',
        size:  [ 32, 34, 36, 40, 42, 44],
        color: ['green', 'black','beige', 'red'],
        details: "Артикул: CLN8134 Бренд: Colin’s Верх: бавовна/еластан Матеріал підкладки: без підкладки Колір: Синій Вид товару: Шорти Сезон: Весна-Літо 2022 Стиль: Casual Країна: Єгипет Стать: Чолов "
    },
    {
        item: 10025,
        title: "Trendyol M-Tac Шорти",
        price: 52,
        imgSrc: '25.jpg',
        size:  [ 36, 40, 42, 44],
        color: ['brown', 'black','beige', 'red'],
        details: "Чоловічі шорти Trendyol з еластичною талією на шнурку. Склад: 60% поліестер, 37% бавовна, 3% еластан."
    },
    {
        item: 10026,
        title: "Trendyol Шорти повсякденні",
        price: 52,
        imgSrc: '26.png',
        size:  [ 36, 40, 42, 44],
        color: ['green', 'yellow', 'red'],
        details: "Чоловічі шорти Trendyol з еластичною талією на шнурку. Склад: 60% бавовна, 40% поліестер."
    },
    {
        item: 10027,
        title: "DeFacto Шорти повсякденні",
        price: 35,
        imgSrc: '27.png',
        size:  [ 40, 42, 44, 46],
        color: ['gray', 'green', 'yellow', 'red'],
        details: "Чоловічі шорти DeFacto на зав’язці шнурівці. Склад: 71% поліестер, 27% бавовна, 2% віскоза."
    },
    {
        item: 10028,
        title: "Marc O’Polo Шорти чінос",
        price: 37,
        imgSrc: '28.png',
        size:  [34, 36, 40, 42, 44],
        color: ['gray', 'green', 'yellow', 'red'],
        details: "Шорти Marc O’Polo (123038415000-736) м'які та зручні, легко комбінуються з будь-яким літнім верхом. Особливості: • з високоякісної м'якої тканини 97% бавовна, 3% еластан • стандартна посадка • із сертифікатом OCS: не мень ніж на 50% з органічних натуральних волокон та без використання синтетичних пестицидів"
    },
    {
        item: 10029,
        title: "Timberland Шорти карго",
        price: 83,
        imgSrc: '29.jpg',
        size:  [ 36, 40, 42, 44],
        color: ['gray', 'green', 'yellow', 'red'],
        details: "Чоловічі шорти Timberland Cargo Shorts (TB0A25E4P47) еластичні, екологічно чисті, виготовлені з м'якої органічної бавовни. Особливості: • Розслаблена посадка • Шкіряні вставки з логотипом • 6 кишень • Склад: 97% органічна бавовна, 3% еластан"
    },
    {
        item: 10030,
        title: "Regatta Шорти карго",
        price: 26,
        imgSrc: '30.jpg',
        size:  [ 36, 38, 40, 42, 44],
        color: ['gray', 'green', 'yellow', 'red'],
        details: "Чоловічі шорти Timberland Cargo Shorts (TB0A25E4P47) еластичні, екологічно чисті, виготовлені з м'якої органічної бавовни. Особливості: • Розслаблена посадка • Шкіряні вставки з логотипом • 6 кишень • Склад: 97% органічна бавовна, 3% еластан"
    },
    {
        item: 10031,
        title: "Trendyol jeans Шорти",
        price: 38,
        imgSrc: '31.jpg',
        size:  [38, 40, 42, 44, 46],
        color: ['gray', 'green', 'black', 'red'],
        details: "Чоловічі шорти Trendyol з еластичною талією на шнурку. Склад: 61% поліестер, 39% бавовна."
    },

]
console.log(catalog);

